export const mapGenreCodeToGenre = (code: number) => {
  const genreCode: Record<number, string> = {
    28: "Бойовик",
    12: "Пригоди",
    16: "Анімація",
    35: "Комедія",
    80: "Кримінал",
    99: "Документальний",
    18: "Драма",
    10751: "Сімейний",
    14: "Фентезі",
    36: "Історичний",
    27: "Жахи",
    10402: "Музичний",
    9648: "Містика",
    10749: "Романтика",
    878: "Наукова фантастика",
    10770: "Телефільм",
    53: "Трилер",
    10752: "Військовий",
    37: "Вестерн",
  };
  return genreCode[code] ?? "Невідомий жанр";
};
